# PYTHON PROGRAMMING FUNDAMENTALS

# TEXT FILES
- fopen() is the key function to handle files 
- open() function takes two parameters; filename, and mode.
- Modes for files opening: 

    - "r" - Read - Default value. Opens a file for reading, error if the file does not exist
    - "a" - Append - Opens a file for appending, creates the file if it does not exist
    - "w" - Write - Opens a file for writing, creates the file if it does not exist
    - "x" - Create - Creates the specified file, returns an error if the file exists

- files can be used in a binary or text mode

    - "t" - Text - Default value. Text mode
    - "b" - Binary - Binary mode (e.g. images)

# CSV FILES

In [1]:
import csv

with open('sample_file.csv') as f:
    readCSV = csv.reader(f, delimiter = ',')
    data = list(readCSV)

In [2]:
data

[['first', ' last', ' email', ' postal', ' gender', ' dollar'],
 ['Joseph', 'Patton', 'daafeja@boh.jm', 'M6U 5U7', 'Male', '$2,629.13 '],
 ['Noah', 'Moran', 'guutodi@bigwoc.kw', 'K2D 4M9', 'Male', '$8,626.96 '],
 ['Nina', 'Keller', 'azikez@gahew.mr', 'S1T 4E6', 'Male', '$9,072.02 ']]

In [5]:
import pyautogui # module not found  pip install pyautogui
import Rake

ModuleNotFoundError: No module named 'Rake'

In [6]:
import pandas as pd

df = pd.read_csv("sample_file.csv")

In [7]:
df

    first    last              email   postal  gender      dollar
0  Joseph  Patton     daafeja@boh.jm  M6U 5U7    Male  $2,629.13
1    Noah   Moran  guutodi@bigwoc.kw  K2D 4M9    Male  $8,626.96
2    Nina  Keller    azikez@gahew.mr  S1T 4E6    Male  $9,072.02

In [17]:
df["first"] + "_" +  df["first"]

0    Joseph_Joseph
1        Noah_Noah
2        Nina_Nina
Name: first, dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   first    3 non-null      object
 1    last    3 non-null      object
 2    email   3 non-null      object
 3    postal  3 non-null      object
 4    gender  3 non-null      object
 5    dollar  3 non-null      object
dtypes: object(6)
memory usage: 272.0+ bytes

In [14]:
full_name = []

for row in data[1:]:
    full_name.append( row[0] + "_" + row[1] )

In [15]:
full_name

['Joseph_Patton', 'Noah_Moran', 'Nina_Keller']

In [6]:
dollar = []
for row in data[1:4]:
    dollar.append(row[5])

In [7]:
dollar

['$2,629.13 ', '$8,626.96 ', '$9,072.02 ']

In [18]:
df

    first    last              email   postal  gender      dollar
0  Joseph  Patton     daafeja@boh.jm  M6U 5U7    Male  $2,629.13
1    Noah   Moran  guutodi@bigwoc.kw  K2D 4M9    Male  $8,626.96
2    Nina  Keller    azikez@gahew.mr  S1T 4E6    Male  $9,072.02

In [19]:
import pandas as pd